In [ ]:
SELECT rentals_may.customer_id, count(rentals_may.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName
FROM sakila.rentals_may
JOIN customer ON rentals_may.customer_id = customer.customer_id
group by customer_id order by count desc

In [ ]:
#SQLAlchemy Loading
from sqlalchemy import create_engine
from getpass import getpass

engine = create_engine(
    (("mysql+pymysql://root:")+getpass()+("0@localhost/sakila")),
    echo=True,
)

In [ ]:
results_may = engine.execute("SELECT rentals_may.customer_id, count(rentals_may.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName FROM sakila.rentals_may JOIN customer ON rentals_may.customer_id = customer.customer_id group by customer_id order by count desc")
may = [dict(row) for row in results_may.fetchall()]
may

In [ ]:
maydf = pd.DataFrame((row) for row in results_may.fetchall()
maydf

In [ ]:
results_june = engine.execute("SELECT rentals_june.customer_id, count(rentals_june.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName FROM sakila.rentals_june JOIN customer ON rentals_june.customer_id = customer.customer_id group by customer_id order by count desc")
june = [dict(row) for row in results_june.fetchall()]
june

In [ ]:
results_june = engine.execute("SELECT rentals_june.customer_id, count(rentals_june.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName FROM sakila.rentals_june JOIN customer ON rentals_june.customer_id = customer.customer_id group by customer_id order by count desc")
june = [dict(row) for row in results_june.fetchall()]
june

In [ ]:
junedf = pd.DataFrame((row) for row in results_june.fetchall()
junedf

In [ ]:
df = pd.read_sql('SELECT * FROM table_name', con=engine)

In [2]:
from sqlalchemy import create_engine
import pymysql
from getpass import getpass

db_connection_str = ("mysql+pymysql://root:")+getpass()+("@localhost/sakila")
db_connection = create_engine(db_connection_str)

········

In [4]:
import pandas as pd

df = pd.read_sql("SELECT rentals_june.customer_id, count(rentals_june.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName FROM sakila.rentals_june JOIN customer ON rentals_june.customer_id = customer.customer_id group by customer_id order by count desc", con=db_connection)

In [5]:
df.head()

   customer_id  count FirstName  LastName
0           31     11    BRENDA    WRIGHT
1          454     10      ALEX   GRESHAM
2          329      9     FRANK  WAGGONER
3          295      9     DAISY     BATES
4          561      9       IAN     STILL